<?php
/**
 * Created by PhpStorm.
 * User: PC_Principal
 * Date: 17.12.2023
 * Time: 21:42
 *
 * Фикстуры справочника умений EFT
 */
return [
    [
        'title' => 'Физические умения',
        'content' => '<p><span style="font-size:16px">Физические умения в Escape from Tarkov&nbsp;влияют на выносливость, метаболизм и здоровье, а также повышает шансы на выживание в бою. Это одна из самых приоритетных категорий умений для прокачки, т.к. именно с ее помощью ваш персонаж сможет быстрее бегать, переносить большее количество веса, а также будет иметь меньше шансов погибнуть при критических ранениях.</span></p>',
        'sortir' => 1,
        'url' => 'physical',
        'description' => 'Физические умения в Таркове влияют на выносливость, метаболизм и здоровье а также повышает шансы на выживание в бою.',
        'keywords' => 'Физические умения Escape from Tarkov',
        'enabled' => 1,
        'preview' => '/img/admin/resized/endurance260218051038.png',
        'bg_style' => 'interback-white'
    ],
    [
        'title' => 'Ментальные умения',
        'content' => '<p><span style="font-size:16px">Ментальные умения в Таркове помогут вам лучше ориентироваться в пространстве. Прокачивая навыки из этой категории вы сможете слышать шумы с более длинных расстояний, сроки запоминания вами уже прокачанных навыков также будут увеличиваться, кроме того, некоторые навыки из категории ментальных&nbsp;также увеличивают шанс нахождения более редкого лута при обыске ящиков, контейнеров и прочего.</span></p>',
        'sortir' => 2,
        'url' => 'mental',
        'description' => 'Ментальные умения в Таркове помогут вам лучше ориентироваться в пространстве. Прокачивая навыки из этой категории вы сможете слышать шумы с более длинных расстояний.',
        'keywords' => 'Ментальные умения в Таркове',
        'enabled' => 1,
        'preview' => '/img/admin/resized/memory270218023924.png',
        'bg_style' => 'interback-grey'
    ],
    [
        'title' => 'Практические умения',
        'content' => '<p><span style="font-size:16px">Физические умения в Escape from Tarkov&nbsp;влияют на выносливость, метаболизм и здоровье, а также повышает шансы на выживание в бою. Это одна из самых приоритетных категорий умений для прокачки, т.к. именно с ее помощью ваш персонаж сможет быстрее бегать, переносить большее количество веса, а также будет иметь меньше шансов погибнуть при критических ранениях.</span></p>',
        'sortir' => 3,
        'url' => 'practical',
        'description' => 'В Escape from Tarkov прокачка практических умений является довольно приоритетной задачей каждого бойца.',
        'keywords' => 'Практические умения Escape from Tarkov',
        'enabled' => 0,
        'preview' => '/img/admin/resized/advanced-modding270218023337.png',
        'bg_style' => 'interback-white'
    ]
];