<?php
/**
 * Created by PhpStorm.
 * User: PC_Principal
 * Date: 03.09.2022
 * Time: 19:37
 *
 * Фикстуры лута для страниц тестирования лута
 */
return [
  [
      'id' => 1,
      'title' => 'Снайперская винтовка СВ-98',
      'preview' => '/img/admin/resized/sv98031018072416.png',
      'shortdesc' => 'СВ-98 - Российская снайперская винтовка, разработанная 1998-2000 гг. группой конструкторов под руководством В. Стронского.',
      'content' => '<p>Основное содержимое предмета справочника лута, здесь может быть очень много информации</p>',
      'active' => 1,
      'parentcat_id' => 1,
      'url' => 'sv-98',
      'description' => 'Снайперская винтовка СВ-98',
      'keywords' => 'Снайперская винтовка СВ-98, СВ-98, снайперская винтовка',
      'quest_item' => 0,
      'trader_group' => '',
      'search_words' => 'Снайперка',
      'creator' => 'Максим (KondorMax)'
  ]
];