<?php
/**
 * Created by PhpStorm.
 * User: PC_Principal
 * Date: 25.08.2022
 * Time: 23:05
 *
 * Фикстура торговца для функциональных тестов
 */
return [
    [
        'title' => 'Прапор',
        'preview' => '/img/admin/resized/p2240218062615.jpg',
        'urltoquets' => '/quests-of-traders/prapor-quests',
        'button_quests' => 'Перейти в раздел квестов Прапора',
        'button_detail' => 'Перейти в раздел Прапора',
        'bg_style' => 'interback-white',
        'enabled' => 1,
        'content' => '<p><span style="font-size:16px">Прапор выдает довольного много квестов а также торгует оружием. У прапора в Escape from Tarkov вы сможете купить автоматы калашникова, снайперскую винтовку СВ-98, укороченные автоматы АКС-У пистолеты и пистолеты-пулеметы, также Прапор продает гранаты. Репутацию с Прапором необходимо прокачивать в первую очередь, т.к. большую часть оружия вы будете покупать именно у него, кроме всего прочего ему, также можно продавать оружие и пистолеты.</span></p><p><span style="font-size:16px">У Прапора нет сложных квестов, в основном все его задания подразумевают убийство Диких и поиск различных квестовых предметов на карте, большую часть квестов вы сможете пройти в одиночку без посторонней помощи.</span></p>',
        'sortir' => 1,
        'fullcontent' => '',
        'description' => 'Прапор. Escape from Tarkov.',
        'keywords' => 'Прапор из Escape from Tarkov, Что продаёт Прапор в Escape from Tarkov, все о торговце Прапоре.',
        'url' => 'prapor'
    ]
];