<?php
/**
 * Created by PhpStorm.
 * User: PC_Principal
 * Date: 25.08.2022
 * Time: 23:05
 *
 * Фикстура торговца для функциональных тестов
 */
return [
    [
        'title' => 'Прапор',
        'preview' => '/img/admin/resized/p2240218062615.jpg',
        'urltoquets' => '/quests-of-traders/prapor-quests',
        'button_quests' => 'Перейти в раздел квестов Прапора',
        'button_detail' => 'Перейти в раздел Прапора',
        'bg_style' => 'interback-white',
        'enabled' => 1,
        'content' => '<p><span style="font-size:16px">Прапор выдает довольного много квестов а также торгует оружием. У прапора в Escape from Tarkov вы сможете купить автоматы калашникова, снайперскую винтовку СВ-98, укороченные автоматы АКС-У пистолеты и пистолеты-пулеметы, также Прапор продает гранаты. Репутацию с Прапором необходимо прокачивать в первую очередь, т.к. большую часть оружия вы будете покупать именно у него, кроме всего прочего ему, также можно продавать оружие и пистолеты.</span></p><p><span style="font-size:16px">У Прапора нет сложных квестов, в основном все его задания подразумевают убийство Диких и поиск различных квестовых предметов на карте, большую часть квестов вы сможете пройти в одиночку без посторонней помощи.</span></p>',
        'sortir' => 1,
        'fullcontent' => '',
        'description' => 'Прапор. Escape from Tarkov.',
        'keywords' => 'Прапор из Escape from Tarkov, Что продаёт Прапор в Escape from Tarkov, все о торговце Прапоре.',
        'url' => 'prapor'
    ],
    [
        'title' => 'Терапевт',
        'preview' => '/img/admin/resized/terapevt240218063007.jpg',
        'urltoquets' => '/quests-of-traders/terapevt-quests',
        'button_quests' => 'Перейти в раздел квестов Терапевта',
        'button_detail' => 'Перейти в раздел Терапевта',
        'bg_style' => 'interback-grey',
        'enabled' => 1,
        'content' => '<p><span style="font-size:16px">Терапевт в Escape from Tarkov является персонажем второго плана, она торгует бинтами, аптечками, шинами для переломов, также можно купить еду и воду.</span></p><p><span style="font-size:16px">У терапевта квесты в основном подразумевают поиск предметов на карте, например воды или еды. Они довольно простые, однако репутация с этим торговцем у вас не должна стоять в приоритете. Репутацию с Терапевтом стоит прокачивать в самую последнюю очередь.</span></p>',
        'sortir' => 2,
        'fullcontent' => '',
        'description' => 'Терапевт. Escape from Tarkov.',
        'keywords' => 'Терапевт из Escape from Tarkov, Что продаёт Терапевт в Escape from Tarkov, все о торговце Терапевте',
        'url' => 'terapevt'
    ],
    [
        'title' => 'Миротворец',
        'preview' => '/img/admin/resized/mirotvorec240218063026.jpg',
        'urltoquets' => '/quests-of-traders/mirotvorec-quests',
        'button_quests' => 'Перейти в раздел квестов Миротворца',
        'button_detail' => 'Перейти в раздел Миротворца',
        'bg_style' => 'interback-white',
        'enabled' => 1,
        'content' => '<p><span style="font-size:16px">Миротворец торгует Западными товарами. В арсенале Миротворца в Escape from Tarkov вы можете найти американские автоматы и пистолеты пулеметы, самый покупаемый товар у Миротворца это автомат M4A1. Также у него можно покупать бронежилеты, гранаты М-67, Важный момент заключается в том что Миротворец торгует товарами за доллары, это значит что для того чтобы прокачать с ним репутацию, вам придется продать ему очень много добычи из рейдов но оно того стоит.</span></p>',
        'sortir' => 5,
        'fullcontent' => '',
        'description' => 'Миротворец. Escape from Tarkov.',
        'keywords' => 'Миротворец из Escape from Tarkov, Что продаёт Миротворец в EFT, все о торговце Миротворец в EFT.',
        'url' => 'mirotvorec'
    ],
    [
        'title' => 'Лыжник',
        'preview' => '/img/admin/resized/lyjnic240218063018.jpg',
        'urltoquets' => '/quests-of-traders/lyjnic-quests',
        'button_quests' => 'Перейти в раздел квестов Лыжника',
        'button_detail' => 'Перейти в раздел Лыжника',
        'bg_style' => 'interback-grey',
        'enabled' => 1,
        'content' => '<p><span style="font-size:16px">Лыжник продает различные предметы из экипировки - это обвесы, рюкзаки, головные уборы, бронежилеты. Также у него можно купить любые виды дробовиков, и охотничьи ружья. На последнем уровне репутации с Лыжником вы сможете купить у него снайперскую винтовку ДВЛ-10.</span></p><p><span style="font-size:16px">У лыжника пожалуй самые сложные квесты в игре, в особенности первый квест, который называется &quot;Снабженец&quot;. Квесты Лыжника зачастую подразумевают убийства операторов ЧВК (игроков) а также поиск предметов на карте в труднодоступных и опасных местах. Однако приоритет прокачки репутации с лыжником очень высокий, т.к. именно у него на последнем уровне репутации вы сможете покупать тяжелый бронежилет &quot;Форт-М&quot; и шлем &quot;Кивер-М&quot;.</span></p>',
        'sortir' => 4,
        'fullcontent' => '',
        'description' => 'Лыжник. Escape from Tarkov.',
        'keywords' => 'Лыжник из Escape from Tarkov, Что продаёт Лыжник в Escape from Tarkov, все о торговце Лыжнике.',
        'url' => 'lyjnic'
    ]
];