<?php
/**
 * Created by PhpStorm.
 * User: PC_Principal
 * Date: 25.08.2022
 * Time: 23:05
 *
 * Фикстура торговца для функциональных тестов - тут 7 записей
 */
return [
    [
        'title' => 'Прапор',
        'preview' => '/img/admin/resized/p2240218062615.jpg',
        'urltoquets' => '/quests-of-traders/prapor-quests',
        'button_quests' => 'Перейти в раздел квестов Прапора',
        'button_detail' => 'Перейти в раздел Прапора',
        'bg_style' => 'interback-white',
        'enabled' => 1,
        'content' => '<p><span style="font-size:16px">Прапор выдает довольного много квестов а также торгует оружием. У прапора в Escape from Tarkov вы сможете купить автоматы калашникова, снайперскую винтовку СВ-98, укороченные автоматы АКС-У пистолеты и пистолеты-пулеметы, также Прапор продает гранаты. Репутацию с Прапором необходимо прокачивать в первую очередь, т.к. большую часть оружия вы будете покупать именно у него, кроме всего прочего ему, также можно продавать оружие и пистолеты.</span></p><p><span style="font-size:16px">У Прапора нет сложных квестов, в основном все его задания подразумевают убийство Диких и поиск различных квестовых предметов на карте, большую часть квестов вы сможете пройти в одиночку без посторонней помощи.</span></p>',
        'sortir' => 1,
        'fullcontent' => '',
        'description' => 'Прапор. Escape from Tarkov.',
        'keywords' => 'Прапор из Escape from Tarkov, Что продаёт Прапор в Escape from Tarkov, все о торговце Прапоре.',
        'url' => 'prapor'
    ],
    [
        'title' => 'Терапевт',
        'preview' => '/img/admin/resized/terapevt240218063007.jpg',
        'urltoquets' => '/quests-of-traders/terapevt-quests',
        'button_quests' => 'Перейти в раздел квестов Терапевта',
        'button_detail' => 'Перейти в раздел Терапевта',
        'bg_style' => 'interback-grey',
        'enabled' => 1,
        'content' => '<p><span style="font-size:16px">Терапевт в Escape from Tarkov является персонажем второго плана, она торгует бинтами, аптечками, шинами для переломов, также можно купить еду и воду.</span></p><p><span style="font-size:16px">У терапевта квесты в основном подразумевают поиск предметов на карте, например воды или еды. Они довольно простые, однако репутация с этим торговцем у вас не должна стоять в приоритете. Репутацию с Терапевтом стоит прокачивать в самую последнюю очередь.</span></p>',
        'sortir' => 2,
        'fullcontent' => '',
        'description' => 'Терапевт. Escape from Tarkov.',
        'keywords' => 'Терапевт из Escape from Tarkov, Что продаёт Терапевт в Escape from Tarkov, все о торговце Терапевте',
        'url' => 'terapevt'
    ],
    [
        'title' => 'Миротворец',
        'preview' => '/img/admin/resized/mirotvorec240218063026.jpg',
        'urltoquets' => '/quests-of-traders/mirotvorec-quests',
        'button_quests' => 'Перейти в раздел квестов Миротворца',
        'button_detail' => 'Перейти в раздел Миротворца',
        'bg_style' => 'interback-white',
        'enabled' => 1,
        'content' => '<p><span style="font-size:16px">Миротворец торгует Западными товарами. В арсенале Миротворца в Escape from Tarkov вы можете найти американские автоматы и пистолеты пулеметы, самый покупаемый товар у Миротворца это автомат M4A1. Также у него можно покупать бронежилеты, гранаты М-67, Важный момент заключается в том что Миротворец торгует товарами за доллары, это значит что для того чтобы прокачать с ним репутацию, вам придется продать ему очень много добычи из рейдов но оно того стоит.</span></p>',
        'sortir' => 5,
        'fullcontent' => '',
        'description' => 'Миротворец. Escape from Tarkov.',
        'keywords' => 'Миротворец из Escape from Tarkov, Что продаёт Миротворец в EFT, все о торговце Миротворец в EFT.',
        'url' => 'mirotvorec'
    ],
    [
        'title' => 'Лыжник',
        'preview' => '/img/admin/resized/lyjnic240218063018.jpg',
        'urltoquets' => '/quests-of-traders/lyjnic-quests',
        'button_quests' => 'Перейти в раздел квестов Лыжника',
        'button_detail' => 'Перейти в раздел Лыжника',
        'bg_style' => 'interback-grey',
        'enabled' => 1,
        'content' => '<p><span style="font-size:16px">Лыжник продает различные предметы из экипировки - это обвесы, рюкзаки, головные уборы, бронежилеты. Также у него можно купить любые виды дробовиков, и охотничьи ружья. На последнем уровне репутации с Лыжником вы сможете купить у него снайперскую винтовку ДВЛ-10.</span></p><p><span style="font-size:16px">У лыжника пожалуй самые сложные квесты в игре, в особенности первый квест, который называется &quot;Снабженец&quot;. Квесты Лыжника зачастую подразумевают убийства операторов ЧВК (игроков) а также поиск предметов на карте в труднодоступных и опасных местах. Однако приоритет прокачки репутации с лыжником очень высокий, т.к. именно у него на последнем уровне репутации вы сможете покупать тяжелый бронежилет &quot;Форт-М&quot; и шлем &quot;Кивер-М&quot;.</span></p>',
        'sortir' => 4,
        'fullcontent' => '',
        'description' => 'Лыжник. Escape from Tarkov.',
        'keywords' => 'Лыжник из Escape from Tarkov, Что продаёт Лыжник в Escape from Tarkov, все о торговце Лыжнике.',
        'url' => 'lyjnic'
    ],
    [
        'title' => 'Скупщик',
        'preview' => '/img/admin/resized/skupshik240218063039.jpg',
        'urltoquets' => '/quests-of-traders/skypshik-quests',
        'button_quests' => 'Перейти в раздел квестов Скупщика',
        'button_detail' => 'Перейти в раздел Скупщика',
        'bg_style' => 'interback-white',
        'enabled' => 1,
        'content' => '<p><span style="font-size:16px">Скупщик торгует всем подряд, у него постоянно обновляется инвентарь предметов, поэтому всякий раз, когда вы будете обновлять окно торговли со Скупщиком - вы сможете увидеть самые разные предметы. У скупщика можно купить абсолютно все, однако стоит помнить, что другие игроки тоже следят за инвентарем скупщика, поэтому если вы увидите что то ценное - следует немедленно забрать этот предмет себе.</span></p><p>&nbsp;</p>',
        'sortir' => 3,
        'fullcontent' => '<p><span style="font-size:16px">С самого зарождения конфликта Скупщик&nbsp;уже начинал действовать, организуя анонимные точки приёма и сбыта товара. Оставаясь инкогнито, смог организовать отлаженную сеть контрабандистов по всей Норвинской области.</span></p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p><span style="font-size:16px">Пара скриншотов того, что можно найти у Скупщика.</span></p><p><span style="font-size:16px"><img alt="" class="image-link" src="/img/upload/traders/skupshik/skupshik.png" style="float:left; margin:5px 15px; width:20%" /><img alt="" class="image-link" src="/img/upload/traders/skupshik/skupshik_2.png" style="float:left; margin:5px 15px; width:20%" /></span></p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><h2><span style="font-size:18px"><strong>Что покупает Скупщик.</strong></span></h2><p><span style="font-size:16px">Скупщик <strong>покупает всё</strong>. Нюанс заключается в том, что <strong>цена</strong>, за которую вы можете продать что-то Скупщику, будет <strong>в 2-3 раза ниже</strong>, чем у других торговцев.​</span></p><h2><span style="font-size:18px"><strong>Что стоит продавать Скупщику.</strong></span></h2><p><span style="font-size:16px">В основном&nbsp;это будут те предметы, которые у вас не купят другие торговцы из-за низкого технического состояния предмета.</span></p><h2><span style="font-size:18px"><strong>Что продаёт Скупщик.</strong></span></h2><p><span style="font-size:16px">В продаже у Скупщика может появиться всё, что угодно. Это может быть ключница, граната Ф-1, шоколад, R11 RSASS, броня 6б43 и т.д. Эти предметы могут появиться в любом техническом состоянии и от этого будет зависеть цена на предмет. <strong>Цена</strong> покупки на все предметы может быть <strong>выше на 15-30%</strong>.</span></p>',
        'description' => 'Скупщик. Escape from Tarkov.',
        'keywords' => 'Скупщик из Escape from Tarkov, Что продаёт Скупщик в Escape from tarkov., все о торговце Скупщике.',
        'url' => 'skupshik'
    ],
    [
        'title' => 'Барахольщик',
        'preview' => '/img/admin/resized/barakholshik050518061242.png',
        'urltoquets' => '/quests-of-traders/baraholshik-quests',
        'button_quests' => 'Перейти в раздел квестов Барахольщика',
        'button_detail' => 'Перейти в раздел Барахольщика',
        'bg_style' => 'interback-white',
        'enabled' => 1,
        'content' => '<p><span style="font-size:16px">Этот торговец торгует предметами экипировки, головными уборами и аксессуарами. У Барахольщика также можно приобрести начиная со второго уровня репутации, шлемы, боьшие рюкзаки и разгрузки. Также он продает наушники, как стандартные так и более усовершенствованные.</span></p><p><span style="font-size:16px">На 4 уровне лояльности&nbsp;(корона) вам станут доступны все виды наушников, разгурзок и шлемов. Прокачака репутации стоит в приоритете с этим торговцем, т.к. теперь он продает большую часть серьезной экипировки в игре. Также на 4 уровне репутации у него будут доступны к обмену бронежилет 6Б43 6А (Он же ФОРТ)</span><span style="font-size:16px">, а также можно будет купить.&nbsp;</span></p>',
        'sortir' => 7,
        'fullcontent' => '',
        'description' => 'Барахольщик из Escape from Tarkov - продает высококлассные предметы экипировки необходимыя для выживания в Таркове.',
        'keywords' => 'Барахольщик из Escape from Tarkov, Что продаёт Барахольщик в Escape from Tarkov, все о торговце Барахольщике.',
        'url' => 'baraholshik'
    ],
    [
        'title' => 'Егерь',
        'preview' => '/img/admin/resized/EGER150922040216.jpg',
        'urltoquets' => '/quests-of-traders/eger-quests',
        'button_quests' => 'Перейти в раздел квестов Егеря',
        'button_detail' => 'Перейти в раздел Егеря',
        'bg_style' => 'interback-grey',
        'enabled' => 0,
        'content' => '<p><span style="font-size:16px">Егерь специализируется на продаже всякого рода охотничьи ружей и винтовок. У него всегда можно найти дробовики и всякого рода охотничью экипировку. На ранних уровнях довольно востребованный торговец, т.к. позволяет выгодно покупать недорогую экипировку, которую не жалко потерять. У этого торговца также огромный выбор патронов для дробовиков как Slug типа так и картечь. Также продает модули для охотничьих ружей.</span></p><p><span style="font-size:16px">На первом уровне у него можно выменять некоторые разгрузки и рюкзак. 4-й уровень репутации с этим торговцем открывает доступ к высокоуровневым снайперским винтовкам и оптическим прицелам высокой кратности.</span></p>',
        'sortir' => 8,
        'fullcontent' => '',
        'description' => 'Егерь из Escape from Tarkov - продает высококлассные предметы экипировки необходимые для выживания в Таркове.',
        'keywords' => 'Егерь из Escape from Tarkov, Что продаёт Егерь в Escape from Tarkov, все о торговце Егере.',
        'url' => 'eger'
    ]
];